app/controllers/candidatos_controller.rb

  def index
    if current_user
      @candidato = Candidato.where(cpf: @current_user.cpf).count
---
SELECT COUNT(*) FROM "candidatos" WHERE "candidatos"."CPF" = $1  [["CPF", "12345687"]]

  def show
    if current_user.tipoUser == 'candidato'
      @candidato = Candidato.where(cpf: @current_user.cpf)
    elsif current_user.tipoUser == 'admin'
      if params[:campos_select] == "Documento"
        @candidato = Candidato.where('cpf ILIKE ?', "%#{params[:campos_value]}%")
      elsif params[:campos_select] == "Nome"
        @candidato = Candidato.where('nome ILIKE ?', "%#{params[:campos_value]}%")
      elsif params[:campos_select] == "Cidade"
        @candidato = Candidato.where('cidade ILIKE ?', "%#{params[:campos_value]}%")
      else
        @candidato = Candidato.all
---
SELECT "candidatos".* FROM "candidatos" WHERE "candidatos"."cpf" = $1  [["cpf", "123456"]]
SELECT "candidatos".* FROM "candidatos"

  def edit
    if current_user.tipoUser == "candidato"
      findQuery = Candidato.where(cpf: @current_user.cpf)
      id = findQuery.ids
      @candidato = Candidato.find_by_id(id)
    elsif current_user.tipoUser == "admin"
      @candidato = Candidato.find(params[:id])
      findEmail = User.where(cpf: @candidato.cpf)
      idEmail = findEmail.ids
      @email = User.find_by_id(idEmail)
---
SELECT "candidatos"."id" FROM "candidatos" WHERE "candidatos"."CPF" = $1  [["CPF", "123456"]]
SELECT  "candidatos".* FROM "candidatos" WHERE "candidatos"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 5], ["LIMIT", 1]]

  def create
    if current_user
      if @candidato = Candidato.where(cpf: @current_user.cpf).count == 0
        @candidato = Candidato.new(candidato_params)

        respond_to do |format|
          if @candidato.save
---
SELECT COUNT(*) FROM "candidatos" WHERE "candidatos"."CPF" = $1  [["CPF", "12345687"]]
INSERT INTO "candidatos" ("CPF", "Nome", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["CPF", "821738971"], ["Nome", "edu"], ["created_at", "2019-09-19 02:42:20.327733"], ["updated_at", "2019-09-19 02:42:20.327733"]]

  def update
    @candidato = Candidato.find(params[:id])
    respond_to do |format|
      if @candidato.update(candidato_params)
---
SELECT  "candidatos".* FROM "candidatos" WHERE "candidatos"."id" = $1 LIMIT $2  [["id", 9], ["LIMIT", 1]]
UPDATE "candidatos" SET "logradouro" = $1, "updated_at" = $2 WHERE "candidatos"."id" = $3  [["logradouro", "Friedrich"], ["updated_at", "2019-09-28 15:58:48.688673"], ["id", 9]]

  def destroy
    @candidato = Candidato.find(params[:id])
    @candidato.destroy
---
SELECT  "candidatos".* FROM "candidatos" WHERE "candidatos"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
DELETE FROM "candidatos" WHERE "candidatos"."id" = $1  [["id", 5]]

    def set_candidato
      @candidato = Candidato.where(cpf: current_user.cpf)
---
SELECT "candidatos".* FROM "candidatos" WHERE "candidatos"."CPF" = $1  [["CPF", "12345687"]]