app/controllers/courses_controller.rb

SELECT "courses".* FROM "courses" WHERE "courses"."cpf_candidato" = $1  [["cpf_candidato", "44790119866"]]
---
  def index
    if current_user
      @courses = Course.where(cpf_candidato: @current_user.cpf)

SELECT "courses"."id" FROM "courses" WHERE "courses"."cpf_candidato" = $1  [["cpf_candidato", "44790119866"]]
SELECT  "courses".* FROM "courses" WHERE "courses"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def edit
    if current_user
      findQuery = Course.where(cpf_candidato: @current_user.cpf)
      id = findQuery.ids
      @course = Course.find_by_id(id)

INSERT INTO "courses" ("nome", "instituicao", "inicio", "final", "cpf_candidato", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
  def create
    if current_user
      @course = Course.new(course_params)

      respond_to do |format|
        if @course.save