app/controllers/experiences_controller.rb

SELECT "experiences".* FROM "experiences" WHERE "experiences"."cpf_candidato" = $1  [["cpf_candidato", "44790119866"]]
---
  def index
    if current_user
      @experiences = Experience.where(cpf_candidato: @current_user.cpf)