app/controllers/formations_controller.rb

SELECT "formations".* FROM "formations" WHERE "formations"."cpf_candidato" = $1  [["cpf_candidato", "44790119866"]]
---
  def index
    if current_user
      @formations = Formation.where(cpf_candidato: @current_user.cpf)